касса_Вегас/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Чек</basedOn>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <attributes>
    <name>АдресEmailПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЧекаЕГАИС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <comment>0 - продажа, 1 - возврат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКоррекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеприменениеККТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПредписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКоррекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьЧекаЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАдресаМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакСпособаРасчета</name>
    <type>
      <types>EnumRef.ПризнакиСпособаРасчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложенияККТ</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплатыЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусыЧеков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКоррекции</name>
    <type>
      <types>EnumRef.ТипыКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтчетОРозничныхПродажах</name>
    <type>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйПризнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекОснование</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПродажи</name>
    <type>
      <types>DocumentRef.Чек</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЧекКоррекции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьВводаАкцизнойМарки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимостьШтрихкодаПриПродаже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСУчетомСкидки</name>
      <comment>Заполняется только при возврате товаров. Идентифицирует позицию чека продажи.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлобальныйИдентификаторТорговойЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлатежнойСистемы</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСсылкиОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлипЧек</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

касса_Вегас/src/CommonModules/ИнтеграцияЕГАИСМК/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПодготовитьВходящиеДанныеДляПодписиЧека(Чек) Экспорт
	
	ВходящиеДанные = СтруктураДанныхЧекаККМ();
	
	ВыгружатьНемаркируемуюПродукцию = ЗначениеНастроекВызовСервераПовтИсп.ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекТовары.Ссылка КАК Ссылка,
		|	ЧекТовары.КлючСвязи КАК КлючСвязи,
		|	ЧекТовары.НомерСтроки КАК НомерСтроки,
		|	ЧекТовары.Количество КАК Количество,
		|	ЧекТовары.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
		|	ЧекТовары.НеобходимостьШтрихкодаПриПродаже КАК НеобходимостьШтрихкодаПриПродаже,
		|	ЧекТовары.Номенклатура КАК Номенклатура,
		|	ЧекТовары.СкидкаНаценкаПроцент КАК СкидкаНаценкаПроцент,
		|	ЧекТовары.СкидкаНаценкаСумма КАК СкидкаНаценкаСумма,
		|	ЧекТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЧекТовары.Сумма КАК Сумма,
		|	ЧекТовары.СуммаНДС КАК СуммаНДС,
		|	ЧекТовары.Цена КАК Цена,
		|	ЧекТовары.Штрихкод КАК Штрихкод,
		|	ЧекТовары.ЦенаСУчетомСкидки КАК ЦенаСУчетомСкидки,
		|	ЧекТовары.Номенклатура.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ЧекТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ЧекТовары.Номенклатура.ОбъемАлкогольнойПродукции КАК ОбъемАлкогольнойПродукции,
		|	ЧекТовары.Номенклатура.Крепость КАК Крепость,
		|	ЧекТовары.Номенклатура.КодВидаАлкогольнойПродукции КАК КодВидаАлкогольнойПродукции
		|ИЗ
		|	Документ.Чек.Товары КАК ЧекТовары
		|ГДЕ
		|	ЧекТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекМарки.Ссылка КАК Ссылка,
		|	ЧекМарки.НомерСтроки КАК НомерСтроки,
		|	ЧекМарки.КлючСвязи КАК КлючСвязи,
		|	ЧекМарки.КодМаркировки КАК КодМаркировки
		|ИЗ
		|	Документ.Чек.Марки КАК ЧекМарки
		|ГДЕ
		|	ЧекМарки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Чек);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	АкцизныеМарки = РезультатЗапроса[1].Выгрузить();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.АлкогольнаяПродукция Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Выборка.НеобходимостьВводаАкцизнойМарки И НЕ ВыгружатьНемаркируемуюПродукцию Тогда
			Продолжить;
		КонецЕсли;
		
		Наименование = СокрЛП(Выборка.НоменклатураНаименование);
		
		Если НЕ Выборка.СкидкаНаценкаСумма = 0 Тогда
			Цена = Окр(Выборка.Сумма / Выборка.Количество, 2);
		Иначе
			Цена = Выборка.Цена;
		КонецЕсли;
		
		ШтрихкодТовара = Выборка.Штрихкод;
		Объем          = Выборка.ОбъемАлкогольнойПродукции;
		
		Если Выборка.НеобходимостьВводаАкцизнойМарки Тогда
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("КлючСвязи", Выборка.КлючСвязи);
			СтрокиМарок = АкцизныеМарки.НайтиСтроки(СтруктураОтбора);
			
			МассивМарок = Новый Массив;
			
			Для Каждого Марки Из СтрокиМарок Цикл
				
				СтрокаЧека = СтруктураДанныхСтрокиЧекаККМ();
				СтрокаЧека.Наименование = Наименование;
				СтрокаЧека.Количество   = 1;
				СтрокаЧека.Цена = Цена;
				
				СтрокаЧека.ШтрихкодМарки  = Марки.КодМаркировки;
				СтрокаЧека.ШтрихкодТовара = ШтрихкодТовара;
				СтрокаЧека.Объем          = Объем;
				
				ВходящиеДанные.ТаблицаТоваров.Добавить(СтрокаЧека);
				
			КонецЦикла;
			
		Иначе //deprecated
			
			СтрокаЧека = СтруктураДанныхСтрокиЧекаККМ();
			
			СтрокаЧека.Наименование = Наименование;
			СтрокаЧека.Количество   = Выборка.Количество;
			СтрокаЧека.Цена         = Цена;
			
			СтрокаЧека.ШтрихкодТовара = ШтрихкодТовара;
			СтрокаЧека.Объем          = Объем;
			
			СтрокаЧека.Крепость         = Выборка.Крепость;
			СтрокаЧека.КодВидаПродукции = Выборка.КодВидаАлкогольнойПродукции;
			
			ВходящиеДанные.ТаблицаТоваровБезМарки.Добавить(СтрокаЧека);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если НЕ ВходящиеДанные.ТаблицаТоваров.Количество() = 0 ИЛИ НЕ ВходящиеДанные.ТаблицаТоваровБезМарки.Количество() = 0 Тогда
		
		ВходящиеДанные.ПодписьЕГАИС = Истина;
		
		Если НЕ ЗначениеНастроекВызовСервераПовтИсп.НезаполненныеПараметрыЕГАИС().Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Не заполнены обязательные параметры для пробития алкогольного чека.
										|(см. раздел ""Начало"")'");
										
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	Иначе
		
		Возврат ВходящиеДанные;
	КонецЕсли;
	
	ВходящиеДанные.ИНН                  = ЗначениеНастроекВызовСервераПовтИсп.ИНН();
	ВходящиеДанные.КПП                  = ЗначениеНастроекВызовСервераПовтИсп.КПП();
	ВходящиеДанные.АдресМагазина        = ЗначениеНастроекВызовСервераПовтИсп.АдресМагазина();
	ВходящиеДанные.НаименованиеМагазина = ЗначениеНастроекВызовСервераПовтИсп.НаименованиеМагазина();
	ВходящиеДанные.ЗаводскойНомерККМ    = ЗначениеНастроекВызовСервераПовтИсп.ЗаводскойНомерККМ();
	
	ВходящиеДанные.ДатаВремяЧека        = Чек.Дата;
	ВходящиеДанные.Возврат              = Чек.ВидОперации = 1;
	
	Возврат ВходящиеДанные;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру данных чека для формирования подписи ЕГАИС.
//
Функция СтруктураДанныхЧекаККМ()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИНН"                   , "");           // ИНН Организации
	СтруктураДанных.Вставить("КПП"                   , Неопределено); // КПП обособленного подразделения по розничной лицензии.
	СтруктураДанных.Вставить("АдресМагазина"         , "");           // Адрес обособленного подразделения по розничной лицензии (Длина до 128 символов).
	СтруктураДанных.Вставить("НаименованиеМагазина"  , "");           // Наименование магазина (Длина до 128 символов).
	СтруктураДанных.Вставить("ЗаводскойНомерККМ"     , "");           // Заводской номер ККМ (Длина до 128 символов).
	СтруктураДанных.Вставить("НомерСменыККМ"         , 0);            // Номер смены. Всегда 1.
	СтруктураДанных.Вставить("НомерЧекаККМ"          , 0);            // Номер чека.  Всегда 1.
	СтруктураДанных.Вставить("ДатаВремяЧека"         , '00010101000000');   // Дата, время чека. Формат: ДДММГГЧЧММ - день, месяц, год, часы, минуты.
	СтруктураДанных.Вставить("Возврат"               , Ложь);         // Если Истина - то покупатель возвращает товар.
	СтруктураДанных.Вставить("ТаблицаТоваров"        , Новый Массив); // Таблица товаров
	СтруктураДанных.Вставить("ТаблицаТоваровБезМарки", Новый Массив); // Таблица товаров без марки //deprecated
	СтруктураДанных.Вставить("ПодписьЕГАИС"          , Ложь);         // Признак необходимости подписи чека ЕГАИС
	
	Возврат СтруктураДанных;
	
КонецФункции // СтруктураДанныхЧекаККМ()

// Возвращает структуру данных строки чека для формирования подписи ЕГАИС.
//
Функция СтруктураДанныхСтрокиЧекаККМ()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Цена"            , 0);
	СтруктураДанных.Вставить("ШтрихкодМарки"   , "");
	СтруктураДанных.Вставить("ШтрихкодТовара"  , "");
	СтруктураДанных.Вставить("Объем"           , 0);
	СтруктураДанных.Вставить("КодВидаПродукции", "");
	СтруктураДанных.Вставить("Наименование"    , "");
	СтруктураДанных.Вставить("Крепость"        , 0);
	СтруктураДанных.Вставить("Количество"      , 0);
	
	Возврат СтруктураДанных;
	
КонецФункции // СтруктураДанныхСтрокиЧекаККМ()

#КонецОбласти
